//@strict-types

#Область ПрограммныйИнтерфейс

// Находит индекс первого вхождения подмассива в массиве.
// Если массив не содержит подмассив, то возвращается -1
// 
// Параметры:
//   ИсходныйМассив - Массив из Произвольный
//   Подмассив - Массив из Произвольный
//  
// Возвращаемое значение:
//   Число
//
Функция НайтиПодмассив(ИсходныйМассив, Подмассив) Экспорт

	Возврат ИндексВхожденияПодмассива(ИсходныйМассив, Подмассив);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает индекс первого вхождения подмассива в массив.
//
// Параметры:
//   ИсходныйМассив - Массив из Произвольный
//   Подмассив - Массив из Произвольный
//  
// Возвращаемое значение:
//   Число - индекс первого вхождения подмассива; -1, если вхождение не найдено
//
Функция ИндексВхожденияПодмассива(ИсходныйМассив, Подмассив)

	РазмерПодмассива = Подмассив.Количество();
	Если РазмерПодмассива = 0 Тогда
		Возврат 0;
	КонецЕсли;

	МЧС = МассивЧастичныхСовпадений(Подмассив);

	РазмерСовпадения = 0;
	Для Инд = 0 По ИсходныйМассив.Количество() - 1 Цикл
		Пока РазмерСовпадения > 0 И ИсходныйМассив[Инд] <> Подмассив[РазмерСовпадения] Цикл
			РазмерСовпадения = МЧС[РазмерСовпадения - 1];
		КонецЦикла;

		Если ИсходныйМассив[Инд] = Подмассив[РазмерСовпадения] Тогда
			РазмерСовпадения = РазмерСовпадения + 1;
		КонецЕсли;

		Если РазмерСовпадения = РазмерПодмассива Тогда
			Возврат Инд - РазмерПодмассива + 1;
		КонецЕсли;

	КонецЦикла;

	Возврат -1;

КонецФункции

// Возвращает массив частичных совпадений (префикс-функцию), построенный для подмассива.
//
// Параметры:
//   Подмассив - Массив из Произвольный
//  
// Возвращаемое значение:
//   Массив из Число - значения префикс-функции для каждой позиции подмассива
//
Функция МассивЧастичныхСовпадений(Подмассив)

	РазмерПодмассива = Подмассив.Количество();

	МЧС = Новый Массив(РазмерПодмассива); // Массив из Число
	Если РазмерПодмассива = 0 Тогда
		Возврат МЧС;
	КонецЕсли;

	МЧС[0] = 0;
	РазмерСовпадения = 0;

	Для Инд = 1 По РазмерПодмассива - 1 Цикл
		Пока РазмерСовпадения > 0 И Подмассив[Инд] <> Подмассив[РазмерСовпадения] Цикл
			РазмерСовпадения = МЧС[РазмерСовпадения - 1];
		КонецЦикла;

		Если Подмассив[Инд] = Подмассив[РазмерСовпадения] Тогда
			РазмерСовпадения = РазмерСовпадения + 1;
		КонецЕсли;

		МЧС[Инд] = РазмерСовпадения;

	КонецЦикла;

	Возврат МЧС;

КонецФункции

#КонецОбласти
